Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionExaggerationAttributes Constructor
 Creates a new dimension exaggeration attributes instance. The default is to have exaggeration disabled.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionExaggerationAttributes()
Public Sub New
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
DimensionSetBaseAttributes.DimensionExaggerationAttributes Overload
Tekla.Structures.Drawing Namespace